
def black_box(page: int):
    if page <= 7922400:
        return True
    else:
        return False


def main():
    """
    Вам дали книгу, конкретное количество страниц вам не сообщили,
    но оно точно не превышает 10 000 000.
    
    Вам необходимо вычислить номер последней страницы.
    Книгу открывать нельзя - вместо этого вам выдали черный ящик, чтобы слегка усложнить задачу.
    Черному ящику (функция black_box) можно сообщить предполагаемый номер последней страницы,
    а в ответ узнать, есть ли эта страница в книге.
    
    Уточнение:
        black_box возвращает True, если страница последняя
                  возвращает False, если страница не последняя.
    
    
    Важно: написать наиболее эффективный алгоритм (по числу итераций)
    """
    high = 10_000_000
    low = 0

    while high >= low:
        mid = (high + low) // 2
        if black_box(mid):
            low = mid + 1
        else:
            high = mid - 1

    return low - 1


if __name__ == '__main__':
    main()
